---
kind: type
id: T:Autodesk.Revit.UI.EditorInteractionType
source: html/5dba951f-9d86-4205-a829-be4df4ad200d.htm
---
# Autodesk.Revit.UI.EditorInteractionType

Defines the type of interactions a pane has with the active editor when it becomes active in the Revit UI.

## Syntax (C#)
```csharp
public enum EditorInteractionType
```